app/Controllers/Posting.php

SELECT *
FROM `post`
WHERE `id_posting` LIKE '%%' ESCAPE '!'
---
    public function index()
    {
        // $detail  = $this->ambilModel->detail();

        $arr_post = $this->postModel
            ->like('id_posting')
            ->get();

SELECT *
FROM `post`
WHERE `id_posting` LIKE '%%' ESCAPE '!'
---
    public function postingan()
    {
        // $detail  = $this->ambilModel->detail();

        $arr_post = $this->postModel
            ->like('id_posting')
            ->get();

SELECT *
FROM `post`
WHERE `kode_posting` = 'P_009'
 LIMIT 1
UPDATE `post` SET `kode_posting` = 'P_009', `id_admin` = '1', `id_produk` = '2', `cover_latter` = 'Edit 2', `desk_produk` = 'Edit - Update 2', `tanggal` = '2024-01-19', `jam` = '18:00'
WHERE `post`.`id_posting` IN ('2')
---
    public function update(){
        $admin = $this->ambilModel->admin();
        $produk = $this->ambilModel->produk();
        // $modelPost = ;


        $default_posting = $this->request->getGet('kode_posting');
        $default_admin = $this->request->getGet('id_admin');
        $default_produk = $this->request->getGet('id_produk');
        $default_latter = $this->request->getGet('cover_latter');
        $default_deskripsi = $this->request->getGet('desk_produk');
        $default_visual = $this->request->getGet('visual_produk');
        $default_tanggal = $this->request->getGet('tanggal');
        $id = $this->request->getGet('id_posting');
        $default_jam = $this->request->getGet('jam');

        $dataSelect = $this->postModel->where('kode_posting', $default_posting)->first();

        $data_edit = [
            // 'id_posting' => $id,
            'kode_posting' => $default_posting,
            'id_admin' => $default_admin,
            'id_produk' => $default_produk,
            'cover_latter' => $default_latter,
            'desk_produk' => $default_deskripsi,
            'visual_produk' => $default_visual,
            'tanggal' => $default_tanggal,
            'jam' => $default_jam,
        ];

        $this->postModel->update($dataSelect['id_posting'],$data_edit);