app/Models/AmbilModel.php

    public function admin()
    {
        $builder = $this->db->table('admin');
        $builder->select('id_admin, kode_admin, nama_admin');
        $data = $builder->get()->getResultArray();
---
SELECT `id_admin`, `kode_admin`, `nama_admin`
FROM `admin`

    public function produk()
    {
        $builder = $this->db->table('produk');
        $builder->select('id_produk, kode_produk, nama_produk');
        $data = $builder->get()->getResultArray();
---
SELECT `id_produk`, `kode_produk`, `nama_produk`
FROM `produk`

    public function cari()
    {
        $builder = $this->db->table('post');
        $builder->like('status', 'waiting');
        $data = $builder->get()->getResultArray();
---
SELECT *
FROM `post`
WHERE `status` LIKE '%waiting%' ESCAPE '!'